Revit 2027 API
BuiltInFailures.RebarFailures.CannotSolveRebarShapeUsingDataFromDimension Property
 Cannot solve rebar shape using the current constraints.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotSolveRebarShapeUsingDataFromDimension { get; }
Public Shared ReadOnly Property CannotSolveRebarShapeUsingDataFromDimension As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotSolveRebarShapeUsingDataFromDimension {
	FailureDefinitionId^ get ();
}
static member CannotSolveRebarShapeUsingDataFromDimension : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace